# Pandas
> Pandas is an acronym which is derived from "Python and data analysis" and "panel data".

Pandas is a software library written for the Python programming language. It is used for data manipulation and analysis. It provides special data structures and operations for the manipulation of numerical tables and time series.

> Inshort Pandas make datascience easy and effective

## Data structures
- `Series`: 1-Dimensional
- `DataFrame`: MultiDimensional

In [1]:
# Before we can use pandas we need to import it.

# import pandas

# But mostly we import it by renaming to pd

import pandas as pd

# Series

In [2]:
cars = pd.Series(["Aston Martin", "Bently", "BMW", "Honda",  "Kia", "Toyota"])

In [3]:
print(cars)

0    Aston Martin
1          Bently
2             BMW
3           Honda
4             Kia
5          Toyota
dtype: object

In [4]:
colors = pd.Series(["Midnight Blue", "Matte Black", "Metallic Blue", "Silver", "Red", "White"])

In [5]:
colors

0    Midnight Blue
1      Matte Black
2    Metallic Blue
3           Silver
4              Red
5            White
dtype: object

# DataFrame

- Data frame is a main object in pandas. It is used to represent data with rows and columns
- Data frame is a datastructure represent the data in tabular or excel spread sheet like data)

## creating DataFrame

In [6]:
# from series above declared

car_data = pd.DataFrame({"Car Make": cars, "Color": colors})

In [7]:
car_data

       Car Make          Color
0  Aston Martin  Midnight Blue
1        Bently    Matte Black
2           BMW  Metallic Blue
3         Honda         Silver
4           Kia            Red
5        Toyota          White

In [8]:
# Most commonway was to read data from csv files to dataframe

df = pd.read_csv("datasets/weather_data.csv")   #read weather.csv data

df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

We can read and write data from various kinds of files Pandas has the functions to do them.

Most common one is `csv`, `xls`, `txt`

```python
# read from csv
pd.read_csv("filename.csv")

# save dataframe to csv
df.to_csv("filename.csv", index=False)
```

In [9]:
# dataframe from list of tuples
weather_data = [('1/1/2017', 32, 6, 'Rain'),
                ('1/2/2017', 35, 7, 'Sunny'),
                ('1/3/2017', 28, 2, 'Snow'),
                ('1/4/2017', 24, 7, 'Snow'),
                ('1/5/2017', 32, 4, 'Rain'),
                ('1/6/2017', 31, 2, 'Sunny')
               ]

df = pd.DataFrame(weather_data, columns=['day', 'temperature', 'windspeed', 'event'])
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

## Viewing and Accessing the DataFrame

In [10]:
# returns the dimensions of the table
df.shape

(6, 4)

In [11]:
# initial few rows can be printed using head command (default 5 rows)
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [12]:
# last few rows can be printed using tail command (default 5 rows)
df.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [13]:
# Slicing
df[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

### Accessing columns

In [14]:
# prints all the column names
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [15]:
# accessing a column in dataframe
df['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [16]:
# another way accessing a column in dataframe
# this works only if column name doesn't have space
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [17]:
# Accessing two or more columns
# NOTE: we're using two square brackets
df[['day', 'event']]

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [18]:
df['temperature']

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

### Stat Operations on columns

In [19]:
df['temperature'].max()

35

In [20]:
df['temperature'].min()

24

In [21]:
df['temperature'].describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [22]:
df.describe().T

             count       mean       std   min    25%   50%    75%   max
temperature    6.0  30.333333  3.829708  24.0  28.75  31.5  32.00  35.0
windspeed      6.0   4.666667  2.338090   2.0   2.50   5.0   6.75   7.0

In [23]:
# selecting row which has max temperature
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [24]:
#select only day column which has maximum temperature
df.day[df.temperature == df.temperature.max()]

1    1/2/2017
Name: day, dtype: object

## Group-By
- It is similar to the group by in any SQL database

In [25]:
df = pd.read_csv('datasets/weather_data_cities.csv')

df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [26]:
g = df.groupby('city')

In [27]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [28]:
# get specific group
g.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [29]:
# print max of each column in each city
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [30]:
# print mean of each column in each city
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [31]:
g.describe().T

city                  mumbai   new york      paris
temperature count   4.000000   4.000000   4.000000
            mean   88.500000  32.250000  47.750000
            std     3.109126   3.304038   5.315073
            min    85.000000  28.000000  42.000000
            25%    86.500000  31.000000  44.250000
            50%    88.500000  32.500000  47.500000
            75%    90.500000  33.750000  51.000000
            max    92.000000  36.000000  54.000000
windspeed   count   4.000000   4.000000   4.000000
            mean    9.250000   8.000000  12.750000
            std     5.057997   2.708013   5.251984
            min     5.000000   6.000000   8.000000
            25%     5.000000   6.750000   9.500000
            50%     8.500000   7.000000  11.500000
            75%    12.750000   8.250000  14.750000
            max    15.000000  12.000000  20.000000

## Concatenation of DataFrames

In [32]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai","chennai","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})

india_weather

       city  temperature  humidity
0    mumbai           32        80
1   chennai           45        60
2  banglore           30        78

In [33]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [34]:
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1   chennai           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [35]:
# To get continuous index
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1   chennai           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [36]:
# concatenate along the axis 1
df = pd.concat([india_weather, us_weather],axis=1)
df

       city  temperature  humidity      city  temperature  humidity
0    mumbai           32        80  new york           21        68
1   chennai           45        60   chicago           14        65
2  banglore           30        78   orlando           35        75

## Merge DataFrames

In [37]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","chennai","banglore", 'hyderabad'],
    "temperature": [32,45,30,40]})
temperature_df

        city  temperature
0     mumbai           32
1    chennai           45
2   banglore           30
3  hyderabad           40

In [38]:
humidity_df = pd.DataFrame({
    "city": ["chennai","mumbai","banglore"],
    "humidity": [68, 65, 75]})
humidity_df

       city  humidity
0   chennai        68
1    mumbai        65
2  banglore        75

In [39]:
#merge two dataframes with out explicitly mention index
df = pd.merge(temperature_df, humidity_df, on='city')
df

       city  temperature  humidity
0    mumbai           32        65
1   chennai           45        68
2  banglore           30        75

### Outer Join

In [40]:
#OUTER-JOIN
df = pd.merge(temperature_df, humidity_df, on='city', how='outer')
df

        city  temperature  humidity
0     mumbai           32      65.0
1    chennai           45      68.0
2   banglore           30      75.0
3  hyderabad           40       NaN

### Numerical Indexing
- `.loc`: access based on the index of the table
- `.iloc` access based on the position in the table irrespective of index defined

In [41]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45, 1, 2, 3, 4, 5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [42]:
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [43]:
df.iloc[:2]

    0
49  1
48  2

In [44]:
df.loc[1]

0    6
Name: 1, dtype: int64

In [45]:
df.iloc[1]

0    2
Name: 48, dtype: int64